app/views/orders/_order.html.erb

SELECT "orders".* FROM "orders"
---
        <td><%= order.total %></td>
        <td><%= order.order_id %></td>