app/views/orders/index.html.erb

  <tbody>
    <% current_user.orders.each do |order| %>
---
SELECT "orders".* FROM "orders"