app/controllers/comments_controller.rb

  def create
        @product = Product.find(params[:product_id])
    @comment = @product.comments.new(comment_params)
    @comment.user = current_user
    respond_to do |format|
      if @comment.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "comments" ("body", "rating", "product_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["body", "lol IE is so bad"], ["rating", 5], ["product_id", 2], ["user_id", 3], ["created_at", "2015-09-30 21:46:01.611733"], ["updated_at", "2015-09-30 21:46:01.611733"]]