app/controllers/payments_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
INSERT INTO "orders" ("user_id", "product_id", "total", "order_id") VALUES (?, ?, ?, ?)  [["user_id", 1], ["product_id", 3], ["total", 5000.0], ["order_id", "ch_16rBPsILZZIbJhcVqUm30Re8"]]
---
  def create
    @product = Product.find(params[:product_id])
    @user = User.find(params[:user_id])
    token = params[:stripeToken]





  # Create the charge on Stripe's servers - this will charge the user's card
    begin
      charge = Stripe::Charge.create(
        :amount => @product.price, # amount in cents, again
        :currency => "usd",
        :source => token,
        :description => params[:stripeEmail]
        )



      @order = Order.create(user_id: @user, product_id: @product.id, total: @product.price)