app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE (name LIKE '%baby%')
SELECT "products".* FROM "products"
SELECT MAX("products"."updated_at") FROM "products"
SELECT  "products".* FROM "products" LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "products"
---
  def index
    if params[:q]
      search_term = params[:q]
      @products = Product.where("name LIKE ?", "%#{search_term}%")
    else
      @products = Product.all
      @products = Product.all.paginate(page: params[:page], per_page: 5)

SELECT  "comments".* FROM "comments" WHERE "comments"."product_id" = ?  ORDER BY created_at DESC LIMIT 3 OFFSET 0  [["product_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."product_id" = ?  [["product_id", 1]]
---
  def show
    @comments = @product.comments.order("created_at DESC")
    @comments = @product.comments.all.order("created_at DESC").paginate(page: params[:page], per_page: 3)

INSERT INTO "products" ("name", "description", "image_url", "color", "size", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save