app/controllers/users_controller.rb

  def index
    #if user is not admin, cannot access index page
    if current_user.admin == false
      flash[:notice] = "You are not allowed access to the Users page."
        redirect_to(static_pages_index_path)
      else
    @users = User.all
---
SELECT "users".* FROM "users"